tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1904_tdd.h
#define SEG5COM2                      522
#define SEG6COM2                      523
#define SEG7COM2                      524
#define LCDDATA7                      525
#define SEG8COM2                      526
#define SEG9COM2                      527
#define SEG10COM2                     528
#define SEG11COM2                     529
#define SEG12COM2                     530
#define SEG13COM2                     531
#define SEG14COM2                     532
#define SEG15COM2                     533
#define LCDDATA8                      534
#define SEG16COM2                     535
#define SEG17COM2                     536
#define SEG18COM2                     537
#define SEG19COM2                     538
#define SEG20COM2                     539
#define SEG21COM2                     540
#define SEG22COM2                     541
#define SEG23COM2                     542
#define LCDDATA9                      543
#define SEG0COM3                      544
#define SEG1COM3                      545
#define SEG2COM3                      546
#define SEG3COM3                      547
#define SEG4COM3                      548
#define SEG5COM3                      549
#define SEG6COM3                      550
#define SEG7COM3                      551
#define LCDDATA10                     552
#define SEG8COM3                      553
#define SEG9COM3                      554
#define SEG10COM3                     555
#define SEG11COM3                     556
#define SEG12COM3                     557
#define SEG13COM3                     558
#define SEG14COM3                     559
#define SEG15COM3                     560
#define LCDDATA11                     561
#define SEG16COM3                     562
#define SEG17COM3                     563
#define SEG18COM3                     564
#define SEG19COM3                     565
#define SEG20COM3                     566
#define SEG21COM3                     567
#define SEG22COM3                     568
#define SEG23COM3                     569
#define LCDDATA12                     570
#define SEG24COM0                     571
#define SEG25COM0                     572
#define SEG26COM0                     573
#define SEG27COM0                     574
#define SEG28COM0                     575
#define LCDDATA15                     576
#define SEG24COM1                     577
#define SEG25COM1                     578
#define SEG26COM1                     579
#define SEG27COM1                     580
#define SEG28COM1                     581
#define LCDDATA18                     582
#define SEG24COM2                     583
#define SEG25COM2                     584
#define SEG26COM2                     585
#define SEG27COM2                     586
#define SEG28COM2                     587
#define LCDDATA21                     588
#define SEG24COM3                     589
#define SEG25COM3                     590
#define SEG26COM3                     591
#define SEG27COM3                     592
#define SEG28COM3                     593
#define STATUS_SHAD                   594
#define C_SHAD                        595
#define DC_SHAD                       596
#define Z_SHAD                        597
#define WREG_SHAD                     598
#define BSR_SHAD                      599
#define PCLATH_SHAD                   600
#define FSR0L_SHAD                    601
#define FSR0H_SHAD                    602
#define FSR1L_SHAD                    603
#define FSR1H_SHAD                    604
#define STKPTR                        605
#define TOSL                          606
#define TOSH                          607

#endif // _PIC16LF1904_H_
